[
  {
    "id": "doc1",
    "title": "Global markets rally as economic optimism rises",
    "text": "Global stock markets surged today after several countries reported improving economic indicators and easing inflation pressures."
  },
  {
    "id": "doc2",
    "title": "Local elections see record voter turnout",
    "text": "This year's local elections saw a record turnout with several young voters participating for the first time."
  },
  {
    "id": "doc3",
    "title": "New AI model improves medical diagnosis accuracy",
    "text": "Researchers introduced a new artificial intelligence model designed to improve diagnostic accuracy for medical imaging."
  },
  {
    "id": "doc4",
    "title": "City marathon breaks participation records",
    "text": "The annual marathon reached a new high in participation with thousands of athletes joining from around the world."
  },
  {
    "id": "doc5",
    "title": "Climate summit leaders agree on emissions roadmap",
    "text": "World leaders gathered at a climate summit and agreed on a global plan to reduce carbon emissions over the next decade."
  },
  {
    "id": "doc6",
    "title": "Tech giants unveil collaboration for AI safety",
    "text": "Major technology companies announced a joint initiative to ensure ethical and safe development of artificial intelligence systems."
  },
  {
    "id": "doc7",
    "title": "Breakthrough in battery technology promises longer life",
    "text": "Scientists developed a new battery material that significantly extends device usage time while reducing charging duration."
  },
  {
    "id": "doc8",
    "title": "Sports championship concludes with dramatic finale",
    "text": "The national sports championship ended with a thrilling match that kept fans on the edge of their seats."
  },
  {
    "id": "doc9",
    "title": "Cybersecurity experts warn of new phishing campaign",
    "text": "Security researchers discovered a new large-scale phishing campaign targeting financial institutions and consumers."
  },
  {
    "id": "doc10",
    "title": "University researchers publish study on mental health",
    "text": "A new university-led study highlights the increasing need for mental health awareness among young adults."
  },
  {
    "id": "doc11",
    "title": "International trade talks resume after long pause",
    "text": "Negotiators from various countries reconvened to discuss global trade policies and resolve lingering disputes."
  },
  {
    "id": "doc12",
    "title": "Software update fixes critical app vulnerabilities",
    "text": "Developers released an urgent software update to patch critical security vulnerabilities identified in a popular mobile app."
  },
  {
    "id": "doc13",
    "title": "Scientists discover new species in rainforest expedition",
    "text": "A research team discovered several previously unknown species during an ecological survey in the Amazon rainforest."
  },
  {
    "id": "doc14",
    "title": "Healthcare sector sees rise in telemedicine adoption",
    "text": "Telemedicine services have seen significant growth due to increased demand for remote medical consultations."
  },
  {
    "id": "doc15",
    "title": "Major airport undergoes modernization upgrades",
    "text": "The city's main airport began modernization work including new terminals, automated check-in, and advanced security systems."
  },
  {
    "id": "doc16",
    "title": "Oil prices fluctuate amid geopolitical tensions",
    "text": "Global oil prices experienced volatility today following rising geopolitical tensions in key producing regions."
  },
  {
    "id": "doc17",
    "title": "Education ministry announces new curriculum reforms",
    "text": "The government revealed a restructured national curriculum focusing on digital literacy and critical thinking."
  },
  {
    "id": "doc18",
    "title": "Astronomers capture detailed images of distant galaxy",
    "text": "A powerful space telescope captured the most detailed images yet of a distant spiral galaxy millions of light-years away."
  },
  {
    "id": "doc19",
    "title": "New mobile payment system launched nationwide",
    "text": "A new mobile payment platform was launched to provide faster and more secure digital transactions for users."
  },
  {
    "id": "doc20",
    "title": "Farmers adopt smart irrigation to conserve water",
    "text": "Farmers across multiple regions are adopting smart irrigation technologies to improve crop yields and reduce water usage."
  }
]
